#+TITLE: Matrix Powers Kernel

*** DONE Compilation and diagnostics
   #+BEGIN_SRC bash :results none
     make dmpk -B && ./dmpk pde900/pde900.mtx 7 6 10
   #+END_SRC

   *The commented out code should be ignored.*

   *The first column in the result shows the errors, the second column
   shows the norm of the matrix.*

   The first loop compiles the list of errors between the two
   calculations.  =rv{i+1}= contains the matrix vector product
   calculated using DMPK, which should be equal to =B^i*bb=, which is
   the same matrix vector product calculated by octave.  The value in
   parenthesis is the exponent.

   The second loop comples the list of norms of =B^i*bb=.

   #+BEGIN_SRC octave :exports both
     check; B = mmread("pde900/pde900.mtx");
     % idx = [848,877,878,879];
     % gold = full(B)(878,idx) *  bb(idx);
     % idxw = [848, 878, 879, 877];
     % wrong = full(B)(878, idxw) * bb(idxw);
     % i=0; rv{i+1} - reshape(B^i*bb,30,30)';  % note the transpose!!!!
     ans = [];
     for i = 0:9
       ans = [ans ; norm(rv{i+1}'(:) - B^i*bb, Inf)]
     endfor
     % cond(B)
     % reshape(bb,30,30)
     % bb*1
     % gold - wrong
     ans2 = []; 
     for i = 1:10
       ans2 = [ans2 ;norm(B^i*bb)]
     endfor
     ans = [ans ans2 ]
   #+END_SRC

   #+RESULTS:
   |                     0 | 341.4086119048916 |
   | 3.552713678800501e-15 | 1717.136874584686 |
   |  1.13686837721616e-13 | 11723.95141970991 |
   | 9.094947017729282e-13 | 93180.06880550965 |
   | 1.455191522836685e-11 | 806044.8196440764 |
   | 1.746229827404022e-10 | 7369931.542394226 |
   | 1.396983861923218e-09 | 70062613.54001084 |
   | 1.490116119384766e-08 | 684826085.1395652 |
   | 1.341104507446289e-07 | 6826508127.703259 |
   |   9.5367431640625e-07 |  68976764400.5207 |
